SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_protimer.h
/* Bit fields for PROTIMER TXCTRL */
#define _PROTIMER_TXCTRL_RESETVALUE                      0x00000000UL                                      /**< Default value for PROTIMER_TXCTRL           */
#define _PROTIMER_TXCTRL_MASK                            0x00001F1FUL                                      /**< Mask for PROTIMER_TXCTRL                    */
#define _PROTIMER_TXCTRL_TXSETEVENT1_SHIFT               0                                                 /**< Shift value for PROTIMER_TXSETEVENT1        */
#define _PROTIMER_TXCTRL_TXSETEVENT1_MASK                0x1FUL                                            /**< Bit mask for PROTIMER_TXSETEVENT1           */
#define _PROTIMER_TXCTRL_TXSETEVENT1_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for PROTIMER_TXCTRL            */
#define _PROTIMER_TXCTRL_TXSETEVENT1_DISABLED            0x00000000UL                                      /**< Mode DISABLED for PROTIMER_TXCTRL           */
#define _PROTIMER_TXCTRL_TXSETEVENT1_ALWAYS              0x00000001UL                                      /**< Mode ALWAYS for PROTIMER_TXCTRL             */
#define _PROTIMER_TXCTRL_TXSETEVENT1_PRECNTOF            0x00000002UL                                      /**< Mode PRECNTOF for PROTIMER_TXCTRL           */
#define _PROTIMER_TXCTRL_TXSETEVENT1_BASECNTOF           0x00000003UL                                      /**< Mode BASECNTOF for PROTIMER_TXCTRL          */
#define _PROTIMER_TXCTRL_TXSETEVENT1_WRAPCNTOF           0x00000004UL                                      /**< Mode WRAPCNTOF for PROTIMER_TXCTRL          */
#define _PROTIMER_TXCTRL_TXSETEVENT1_TOUT0UF             0x00000005UL                                      /**< Mode TOUT0UF for PROTIMER_TXCTRL            */
#define _PROTIMER_TXCTRL_TXSETEVENT1_TOUT1UF             0x00000006UL                                      /**< Mode TOUT1UF for PROTIMER_TXCTRL            */
#define _PROTIMER_TXCTRL_TXSETEVENT1_TOUT0MATCH          0x00000007UL                                      /**< Mode TOUT0MATCH for PROTIMER_TXCTRL         */
#define _PROTIMER_TXCTRL_TXSETEVENT1_TOUT1MATCH          0x00000008UL                                      /**< Mode TOUT1MATCH for PROTIMER_TXCTRL         */
#define _PROTIMER_TXCTRL_TXSETEVENT1_CC0                 0x00000009UL                                      /**< Mode CC0 for PROTIMER_TXCTRL                */
#define _PROTIMER_TXCTRL_TXSETEVENT1_CC1                 0x0000000AUL                                      /**< Mode CC1 for PROTIMER_TXCTRL                */
#define _PROTIMER_TXCTRL_TXSETEVENT1_CC2                 0x0000000BUL                                      /**< Mode CC2 for PROTIMER_TXCTRL                */
#define _PROTIMER_TXCTRL_TXSETEVENT1_CC3                 0x0000000CUL                                      /**< Mode CC3 for PROTIMER_TXCTRL                */
#define _PROTIMER_TXCTRL_TXSETEVENT1_CC4                 0x0000000DUL                                      /**< Mode CC4 for PROTIMER_TXCTRL                */
#define _PROTIMER_TXCTRL_TXSETEVENT1_TXDONE              0x0000000EUL                                      /**< Mode TXDONE for PROTIMER_TXCTRL             */
#define _PROTIMER_TXCTRL_TXSETEVENT1_RXDONE              0x0000000FUL                                      /**< Mode RXDONE for PROTIMER_TXCTRL             */
#define _PROTIMER_TXCTRL_TXSETEVENT1_TXORRXDONE          0x00000010UL                                      /**< Mode TXORRXDONE for PROTIMER_TXCTRL         */
#define _PROTIMER_TXCTRL_TXSETEVENT1_FDET0               0x00000011UL                                      /**< Mode FDET0 for PROTIMER_TXCTRL              */
#define _PROTIMER_TXCTRL_TXSETEVENT1_FDET1               0x00000012UL                                      /**< Mode FDET1 for PROTIMER_TXCTRL              */
#define _PROTIMER_TXCTRL_TXSETEVENT1_FDET0OR1            0x00000013UL                                      /**< Mode FDET0OR1 for PROTIMER_TXCTRL           */
#define _PROTIMER_TXCTRL_TXSETEVENT1_LBTSUCCESS          0x00000014UL                                      /**< Mode LBTSUCCESS for PROTIMER_TXCTRL         */
#define _PROTIMER_TXCTRL_TXSETEVENT1_LBTRETRY            0x00000015UL                                      /**< Mode LBTRETRY for PROTIMER_TXCTRL           */
#define _PROTIMER_TXCTRL_TXSETEVENT1_LBTFAILURE          0x00000016UL                                      /**< Mode LBTFAILURE for PROTIMER_TXCTRL         */
#define _PROTIMER_TXCTRL_TXSETEVENT1_ANYLBT              0x00000017UL                                      /**< Mode ANYLBT for PROTIMER_TXCTRL             */
#define _PROTIMER_TXCTRL_TXSETEVENT1_CCAACK              0x00000018UL                                      /**< Mode CCAACK for PROTIMER_TXCTRL             */
#define _PROTIMER_TXCTRL_TXSETEVENT1_CCA                 0x00000019UL                                      /**< Mode CCA for PROTIMER_TXCTRL                */
#define _PROTIMER_TXCTRL_TXSETEVENT1_NOTCCA              0x0000001AUL                                      /**< Mode NOTCCA for PROTIMER_TXCTRL             */
#define _PROTIMER_TXCTRL_TXSETEVENT1_TOUT0MATCHLBT       0x0000001BUL                                      /**< Mode TOUT0MATCHLBT for PROTIMER_TXCTRL      */
#define PROTIMER_TXCTRL_TXSETEVENT1_DEFAULT              (_PROTIMER_TXCTRL_TXSETEVENT1_DEFAULT << 0)       /**< Shifted mode DEFAULT for PROTIMER_TXCTRL    */
#define PROTIMER_TXCTRL_TXSETEVENT1_DISABLED             (_PROTIMER_TXCTRL_TXSETEVENT1_DISABLED << 0)      /**< Shifted mode DISABLED for PROTIMER_TXCTRL   */
#define PROTIMER_TXCTRL_TXSETEVENT1_ALWAYS               (_PROTIMER_TXCTRL_TXSETEVENT1_ALWAYS << 0)        /**< Shifted mode ALWAYS for PROTIMER_TXCTRL     */
#define PROTIMER_TXCTRL_TXSETEVENT1_PRECNTOF             (_PROTIMER_TXCTRL_TXSETEVENT1_PRECNTOF << 0)      /**< Shifted mode PRECNTOF for PROTIMER_TXCTRL   */
#define PROTIMER_TXCTRL_TXSETEVENT1_BASECNTOF            (_PROTIMER_TXCTRL_TXSETEVENT1_BASECNTOF << 0)     /**< Shifted mode BASECNTOF for PROTIMER_TXCTRL  */
#define PROTIMER_TXCTRL_TXSETEVENT1_WRAPCNTOF            (_PROTIMER_TXCTRL_TXSETEVENT1_WRAPCNTOF << 0)     /**< Shifted mode WRAPCNTOF for PROTIMER_TXCTRL  */
#define PROTIMER_TXCTRL_TXSETEVENT1_TOUT0UF              (_PROTIMER_TXCTRL_TXSETEVENT1_TOUT0UF << 0)       /**< Shifted mode TOUT0UF for PROTIMER_TXCTRL    */
#define PROTIMER_TXCTRL_TXSETEVENT1_TOUT1UF              (_PROTIMER_TXCTRL_TXSETEVENT1_TOUT1UF << 0)       /**< Shifted mode TOUT1UF for PROTIMER_TXCTRL    */
#define PROTIMER_TXCTRL_TXSETEVENT1_TOUT0MATCH           (_PROTIMER_TXCTRL_TXSETEVENT1_TOUT0MATCH << 0)    /**< Shifted mode TOUT0MATCH for PROTIMER_TXCTRL */
#define PROTIMER_TXCTRL_TXSETEVENT1_TOUT1MATCH           (_PROTIMER_TXCTRL_TXSETEVENT1_TOUT1MATCH << 0)    /**< Shifted mode TOUT1MATCH for PROTIMER_TXCTRL */
#define PROTIMER_TXCTRL_TXSETEVENT1_CC0                  (_PROTIMER_TXCTRL_TXSETEVENT1_CC0 << 0)           /**< Shifted mode CC0 for PROTIMER_TXCTRL        */
#define PROTIMER_TXCTRL_TXSETEVENT1_CC1                  (_PROTIMER_TXCTRL_TXSETEVENT1_CC1 << 0)           /**< Shifted mode CC1 for PROTIMER_TXCTRL        */
#define PROTIMER_TXCTRL_TXSETEVENT1_CC2                  (_PROTIMER_TXCTRL_TXSETEVENT1_CC2 << 0)           /**< Shifted mode CC2 for PROTIMER_TXCTRL        */
#define PROTIMER_TXCTRL_TXSETEVENT1_CC3                  (_PROTIMER_TXCTRL_TXSETEVENT1_CC3 << 0)           /**< Shifted mode CC3 for PROTIMER_TXCTRL        */
#define PROTIMER_TXCTRL_TXSETEVENT1_CC4                  (_PROTIMER_TXCTRL_TXSETEVENT1_CC4 << 0)           /**< Shifted mode CC4 for PROTIMER_TXCTRL        */
#define PROTIMER_TXCTRL_TXSETEVENT1_TXDONE               (_PROTIMER_TXCTRL_TXSETEVENT1_TXDONE << 0)        /**< Shifted mode TXDONE for PROTIMER_TXCTRL     */
#define PROTIMER_TXCTRL_TXSETEVENT1_RXDONE               (_PROTIMER_TXCTRL_TXSETEVENT1_RXDONE << 0)        /**< Shifted mode RXDONE for PROTIMER_TXCTRL     */
#define PROTIMER_TXCTRL_TXSETEVENT1_TXORRXDONE           (_PROTIMER_TXCTRL_TXSETEVENT1_TXORRXDONE << 0)    /**< Shifted mode TXORRXDONE for PROTIMER_TXCTRL */
#define PROTIMER_TXCTRL_TXSETEVENT1_FDET0                (_PROTIMER_TXCTRL_TXSETEVENT1_FDET0 << 0)         /**< Shifted mode FDET0 for PROTIMER_TXCTRL      */
#define PROTIMER_TXCTRL_TXSETEVENT1_FDET1                (_PROTIMER_TXCTRL_TXSETEVENT1_FDET1 << 0)         /**< Shifted mode FDET1 for PROTIMER_TXCTRL      */
#define PROTIMER_TXCTRL_TXSETEVENT1_FDET0OR1             (_PROTIMER_TXCTRL_TXSETEVENT1_FDET0OR1 << 0)      /**< Shifted mode FDET0OR1 for PROTIMER_TXCTRL   */
#define PROTIMER_TXCTRL_TXSETEVENT1_LBTSUCCESS           (_PROTIMER_TXCTRL_TXSETEVENT1_LBTSUCCESS << 0)    /**< Shifted mode LBTSUCCESS for PROTIMER_TXCTRL */
#define PROTIMER_TXCTRL_TXSETEVENT1_LBTRETRY             (_PROTIMER_TXCTRL_TXSETEVENT1_LBTRETRY << 0)      /**< Shifted mode LBTRETRY for PROTIMER_TXCTRL   */
#define PROTIMER_TXCTRL_TXSETEVENT1_LBTFAILURE           (_PROTIMER_TXCTRL_TXSETEVENT1_LBTFAILURE << 0)    /**< Shifted mode LBTFAILURE for PROTIMER_TXCTRL */
#define PROTIMER_TXCTRL_TXSETEVENT1_ANYLBT               (_PROTIMER_TXCTRL_TXSETEVENT1_ANYLBT << 0)        /**< Shifted mode ANYLBT for PROTIMER_TXCTRL     */
#define PROTIMER_TXCTRL_TXSETEVENT1_CCAACK               (_PROTIMER_TXCTRL_TXSETEVENT1_CCAACK << 0)        /**< Shifted mode CCAACK for PROTIMER_TXCTRL     */
#define PROTIMER_TXCTRL_TXSETEVENT1_CCA                  (_PROTIMER_TXCTRL_TXSETEVENT1_CCA << 0)           /**< Shifted mode CCA for PROTIMER_TXCTRL        */
#define PROTIMER_TXCTRL_TXSETEVENT1_NOTCCA               (_PROTIMER_TXCTRL_TXSETEVENT1_NOTCCA << 0)        /**< Shifted mode NOTCCA for PROTIMER_TXCTRL     */
#define PROTIMER_TXCTRL_TXSETEVENT1_TOUT0MATCHLBT        (_PROTIMER_TXCTRL_TXSETEVENT1_TOUT0MATCHLBT << 0) /**< Shifted mode TOUT0MATCHLBT for PROTIMER_TXCTRL*/
#define _PROTIMER_TXCTRL_TXSETEVENT2_SHIFT               8                                                 /**< Shift value for PROTIMER_TXSETEVENT2        */
#define _PROTIMER_TXCTRL_TXSETEVENT2_MASK                0x1F00UL                                          /**< Bit mask for PROTIMER_TXSETEVENT2           */
#define _PROTIMER_TXCTRL_TXSETEVENT2_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for PROTIMER_TXCTRL            */
#define PROTIMER_TXCTRL_TXSETEVENT2_DEFAULT              (_PROTIMER_TXCTRL_TXSETEVENT2_DEFAULT << 8)       /**< Shifted mode DEFAULT for PROTIMER_TXCTRL    */

/* Bit fields for PROTIMER ETSI */
#define _PROTIMER_ETSI_RESETVALUE                        0x00000000UL                                         /**< Default value for PROTIMER_ETSI             */
#define _PROTIMER_ETSI_MASK                              0x03FFFFFFUL                                         /**< Mask for PROTIMER_ETSI                      */
#define PROTIMER_ETSI_ETSIEN                             (0x1UL << 0)                                         /**< ETSI LBT enabling                           */
#define _PROTIMER_ETSI_ETSIEN_SHIFT                      0                                                    /**< Shift value for PROTIMER_ETSIEN             */
#define _PROTIMER_ETSI_ETSIEN_MASK                       0x1UL                                                /**< Bit mask for PROTIMER_ETSIEN                */
#define _PROTIMER_ETSI_ETSIEN_DEFAULT                    0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_ETSI              */
#define PROTIMER_ETSI_ETSIEN_DEFAULT                     (_PROTIMER_ETSI_ETSIEN_DEFAULT << 0)                 /**< Shifted mode DEFAULT for PROTIMER_ETSI      */
#define PROTIMER_ETSI_GRANULARLESSTHANRXWARM             (0x1UL << 1)                                         /**< Granular less than RXWARM                   */
#define _PROTIMER_ETSI_GRANULARLESSTHANRXWARM_SHIFT      1                                                    /**< Shift value for PROTIMER_GRANULARLESSTHANRXWARM*/
#define _PROTIMER_ETSI_GRANULARLESSTHANRXWARM_MASK       0x2UL                                                /**< Bit mask for PROTIMER_GRANULARLESSTHANRXWARM*/
#define _PROTIMER_ETSI_GRANULARLESSTHANRXWARM_DEFAULT    0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_ETSI              */
#define PROTIMER_ETSI_GRANULARLESSTHANRXWARM_DEFAULT     (_PROTIMER_ETSI_GRANULARLESSTHANRXWARM_DEFAULT << 1) /**< Shifted mode DEFAULT for PROTIMER_ETSI      */
#define _PROTIMER_ETSI_RXWARMTHLD_SHIFT                  2                                                    /**< Shift value for PROTIMER_RXWARMTHLD         */
#define _PROTIMER_ETSI_RXWARMTHLD_MASK                   0x3FCUL                                              /**< Bit mask for PROTIMER_RXWARMTHLD            */
#define _PROTIMER_ETSI_RXWARMTHLD_DEFAULT                0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_ETSI              */
#define PROTIMER_ETSI_RXWARMTHLD_DEFAULT                 (_PROTIMER_ETSI_RXWARMTHLD_DEFAULT << 2)             /**< Shifted mode DEFAULT for PROTIMER_ETSI      */
#define _PROTIMER_ETSI_CCAFIXED_SHIFT                    10                                                   /**< Shift value for PROTIMER_CCAFIXED           */
#define _PROTIMER_ETSI_CCAFIXED_MASK                     0x3FFFC00UL                                          /**< Bit mask for PROTIMER_CCAFIXED              */
#define _PROTIMER_ETSI_CCAFIXED_DEFAULT                  0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_ETSI              */
#define PROTIMER_ETSI_CCAFIXED_DEFAULT                   (_PROTIMER_ETSI_CCAFIXED_DEFAULT << 10)              /**< Shifted mode DEFAULT for PROTIMER_ETSI      */

/* Bit fields for PROTIMER LBTSTATE1 */
#define _PROTIMER_LBTSTATE1_RESETVALUE                   0x00000000UL                                /**< Default value for PROTIMER_LBTSTATE1        */
#define _PROTIMER_LBTSTATE1_MASK                         0x00000FFFUL                                /**< Mask for PROTIMER_LBTSTATE1                 */
#define _PROTIMER_LBTSTATE1_CCACNT_SHIFT                 0                                           /**< Shift value for PROTIMER_CCACNT             */
#define _PROTIMER_LBTSTATE1_CCACNT_MASK                  0xFUL                                       /**< Bit mask for PROTIMER_CCACNT                */
#define _PROTIMER_LBTSTATE1_CCACNT_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for PROTIMER_LBTSTATE1         */
#define PROTIMER_LBTSTATE1_CCACNT_DEFAULT                (_PROTIMER_LBTSTATE1_CCACNT_DEFAULT << 0)   /**< Shifted mode DEFAULT for PROTIMER_LBTSTATE1 */
#define _PROTIMER_LBTSTATE1_EXP_SHIFT                    4                                           /**< Shift value for PROTIMER_EXP                */
#define _PROTIMER_LBTSTATE1_EXP_MASK                     0xF0UL                                      /**< Bit mask for PROTIMER_EXP                   */
#define _PROTIMER_LBTSTATE1_EXP_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for PROTIMER_LBTSTATE1         */
#define PROTIMER_LBTSTATE1_EXP_DEFAULT                   (_PROTIMER_LBTSTATE1_EXP_DEFAULT << 4)      /**< Shifted mode DEFAULT for PROTIMER_LBTSTATE1 */
#define _PROTIMER_LBTSTATE1_RETRYCNT_SHIFT               8                                           /**< Shift value for PROTIMER_RETRYCNT           */
#define _PROTIMER_LBTSTATE1_RETRYCNT_MASK                0xF00UL                                     /**< Bit mask for PROTIMER_RETRYCNT              */
#define _PROTIMER_LBTSTATE1_RETRYCNT_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for PROTIMER_LBTSTATE1         */
#define PROTIMER_LBTSTATE1_RETRYCNT_DEFAULT              (_PROTIMER_LBTSTATE1_RETRYCNT_DEFAULT << 8) /**< Shifted mode DEFAULT for PROTIMER_LBTSTATE1 */

/* Bit fields for PROTIMER RANDOMFW0 */
#define _PROTIMER_RANDOMFW0_RESETVALUE                   0x00000000UL                                /**< Default value for PROTIMER_RANDOMFW0        */
#define _PROTIMER_RANDOMFW0_MASK                         0x07FFFFFFUL                                /**< Mask for PROTIMER_RANDOMFW0                 */
#define _PROTIMER_RANDOMFW0_RANDOM0_SHIFT                0                                           /**< Shift value for PROTIMER_RANDOM0            */
#define _PROTIMER_RANDOMFW0_RANDOM0_MASK                 0x1FFUL                                     /**< Bit mask for PROTIMER_RANDOM0               */
#define _PROTIMER_RANDOMFW0_RANDOM0_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_RANDOMFW0         */
#define PROTIMER_RANDOMFW0_RANDOM0_DEFAULT               (_PROTIMER_RANDOMFW0_RANDOM0_DEFAULT << 0)  /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW0 */
#define _PROTIMER_RANDOMFW0_RANDOM1_SHIFT                9                                           /**< Shift value for PROTIMER_RANDOM1            */
#define _PROTIMER_RANDOMFW0_RANDOM1_MASK                 0x3FE00UL                                   /**< Bit mask for PROTIMER_RANDOM1               */
#define _PROTIMER_RANDOMFW0_RANDOM1_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_RANDOMFW0         */
#define PROTIMER_RANDOMFW0_RANDOM1_DEFAULT               (_PROTIMER_RANDOMFW0_RANDOM1_DEFAULT << 9)  /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW0 */
#define _PROTIMER_RANDOMFW0_RANDOM2_SHIFT                18                                          /**< Shift value for PROTIMER_RANDOM2            */
#define _PROTIMER_RANDOMFW0_RANDOM2_MASK                 0x7FC0000UL                                 /**< Bit mask for PROTIMER_RANDOM2               */
#define _PROTIMER_RANDOMFW0_RANDOM2_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_RANDOMFW0         */
#define PROTIMER_RANDOMFW0_RANDOM2_DEFAULT               (_PROTIMER_RANDOMFW0_RANDOM2_DEFAULT << 18) /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW0 */

/* Bit fields for PROTIMER RANDOMFW1 */
#define _PROTIMER_RANDOMFW1_RESETVALUE                   0x00000000UL                                /**< Default value for PROTIMER_RANDOMFW1        */
#define _PROTIMER_RANDOMFW1_MASK                         0x07FFFFFFUL                                /**< Mask for PROTIMER_RANDOMFW1                 */
#define _PROTIMER_RANDOMFW1_RANDOM3_SHIFT                0                                           /**< Shift value for PROTIMER_RANDOM3            */
#define _PROTIMER_RANDOMFW1_RANDOM3_MASK                 0x1FFUL                                     /**< Bit mask for PROTIMER_RANDOM3               */
#define _PROTIMER_RANDOMFW1_RANDOM3_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_RANDOMFW1         */
#define PROTIMER_RANDOMFW1_RANDOM3_DEFAULT               (_PROTIMER_RANDOMFW1_RANDOM3_DEFAULT << 0)  /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW1 */
#define _PROTIMER_RANDOMFW1_RANDOM4_SHIFT                9                                           /**< Shift value for PROTIMER_RANDOM4            */
#define _PROTIMER_RANDOMFW1_RANDOM4_MASK                 0x3FE00UL                                   /**< Bit mask for PROTIMER_RANDOM4               */
#define _PROTIMER_RANDOMFW1_RANDOM4_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_RANDOMFW1         */
#define PROTIMER_RANDOMFW1_RANDOM4_DEFAULT               (_PROTIMER_RANDOMFW1_RANDOM4_DEFAULT << 9)  /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW1 */
#define _PROTIMER_RANDOMFW1_RANDOM5_SHIFT                18                                          /**< Shift value for PROTIMER_RANDOM5            */
#define _PROTIMER_RANDOMFW1_RANDOM5_MASK                 0x7FC0000UL                                 /**< Bit mask for PROTIMER_RANDOM5               */
#define _PROTIMER_RANDOMFW1_RANDOM5_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_RANDOMFW1         */
#define PROTIMER_RANDOMFW1_RANDOM5_DEFAULT               (_PROTIMER_RANDOMFW1_RANDOM5_DEFAULT << 18) /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW1 */

